package a

import (
	"context"
	"log/slog"

	"go.uber.org/zap"
)

func demo() {
	logger := zap.NewNop()
	sugar := logger.Sugar()

	slog.Info("User logged in")                                 // want "лог-сообщение должно начинаться со строчной английской буквы"
	slog.Warn("privet мир")                                     // want "лог-сообщение должно содержать только английский текст \\(кириллица и другие алфавиты запрещены\\)"
	slog.Error("request failed!")                               // want "лог-сообщение не должно содержать спецсимволы \\(!, \\?, \\.\\.\\.\\) и эмодзи"
	slog.Debug("token=123")                                     // want "лог-сообщение содержит потенциально чувствительные данные"
	slog.InfoContext(context.Background(), "session id leaked") // want "лог-сообщение содержит потенциально чувствительные данные"

	logger.Info("api_key leaked")         // want "лог-сообщение содержит потенциально чувствительные данные"
	logger.Warn("request...failed")       // want "лог-сообщение не должно содержать спецсимволы \\(!, \\?, \\.\\.\\.\\) и эмодзи"
	sugar.Infof("password: %s", "qwerty") // want "лог-сообщение содержит потенциально чувствительные данные"
	sugar.Infow("hello 😊", "k", "v")      // want "лог-сообщение не должно содержать спецсимволы \\(!, \\?, \\.\\.\\.\\) и эмодзи"

	slog.Info("valid message")
	logger.Info("valid message")
	sugar.Infow("valid message", "id", 1)
}
